#21.摩斯電碼
dic={
    ".-":"A",
    "-...":"B",
    "-.-.":"C",
    "-..":"D",
    ".":"E",
    "..-.":"F",
    "--.":"G",
    "....":"H",
    "..":"I",
    ".---":"J",
    "-.-":"K",
    ".-..":"L",
    "--":"M",
    "-.":"N",
    "---":"O",
    ".--.":"P",
    "--.-":"Q",
    ".-.":"R",
    "...":"S",
    "-":"T",
    "..-":"U",
    "...-":"V",
    ".--":"W",
    "-..-":"X",
    "-.--":"Y",
    "--..":"Z",
}
codes = [x for x in input().split()]
for code in codes:
    print(dic[code],end="")
print()
#使用dic
#dic = {
#    key:value,
#}宣告
#dic[key] = value2 新增一組值，如果key值相同則更新
#print(dic[key]) 印出value